performance_ruby_2_2_0/rhebok/pi.txt
      done.

Transactions:		       10000 hits
Availability:		      100.00 %
Elapsed time:		      242.16 secs
Data transferred:	       49.02 MB
Response time:		        0.24 secs
Transaction rate:	       41.30 trans/sec
Throughput:		        0.20 MB/sec
Concurrency:		        9.96
Successful transactions:       10000
Failed transactions:	           0
Longest transaction:	        0.51
Shortest transaction:	        0.07
 
FILE: /var/log/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.