performance_ruby_2_2_0/rhebok/server.txt
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[...]
      done.

Transactions:		       99960 hits
Availability:		       99.96 %
Elapsed time:		      121.41 secs
Data transferred:	      237.37 MB
Response time:		        0.11 secs
Transaction rate:	      823.33 trans/sec
Throughput:		        1.96 MB/sec
Concurrency:		       90.34
Successful transactions:       99960
Failed transactions:	          40
Longest transaction:	       15.05
Shortest transaction:	        0.00
 
FILE: /var/log/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.